app/views/gaming_vendor/winning_rules/_form.html.erb

    <div class="col-sm-6">
      <%= f.select :type, WinningRule::CRITERIAS.map { |k,v| [v, k] }, prompt: 'Select', class: 'form-control', required: true %>
---
SELECT  "winning_rules".* FROM "winning_rules" WHERE "winning_rules"."gaming_vendor_id" = $1 AND "winning_rules"."id" = $2 LIMIT 1  [["gaming_vendor_id", 1], ["id", 1]]