app/controllers/gaming_vendor/profiles_controller.rb

  def update
    if current_vendor.update(profile_params)
---
UPDATE "vendors" SET "company_name" = $1, "game_name" = $2, "phone" = $3, "updated_at" = $4, "unconfirmed_email" = $5, "confirmation_token" = $6, "confirmation_sent_at" = $7 WHERE "vendors"."id" = $8