app/controllers/gaming_vendor/winning_rules_controller.rb

  def create
    @winning_rule = current_vendor.winning_rules.build(winning_rule_params)
    if @winning_rule.save
---
INSERT INTO "winning_rules" ("name", "description", "level", "type", "trophy", "realm", "gaming_vendor_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    if @winning_rule.update(winning_rule_params)
---
UPDATE "winning_rules" SET "max_rating" = $1, "updated_at" = $2 WHERE "winning_rules"."id" = $3  [["max_rating", 10], ["updated_at", "2016-05-03 17:53:40.902078"], ["id", 1]]

    def load_winning_rule
      @winning_rule = current_vendor.winning_rules.find(params[:id])
---
SELECT  "winning_rules".* FROM "winning_rules" WHERE "winning_rules"."gaming_vendor_id" = $1 AND "winning_rules"."id" = $2 LIMIT 1  [["gaming_vendor_id", 1], ["id", 1]]