app/controllers/coupon_vendor/coupons_controller.rb

INSERT INTO "coupons" ("coupon_vendor_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["coupon_vendor_id", 2], ["created_at", "2016-05-04 19:38:47.692421"], ["updated_at", "2016-05-04 19:38:47.692421"]]
---
  def create
    @coupon = current_vendor.coupons.build(coupon_params)
    if @coupon.save

UPDATE "coupons" SET "code" = $1, "title" = $2, "company_name" = $3, "company_website" = $4, "availability" = $5, "details" = $6, "conditions" = $7, "updated_at" = $8 WHERE "coupons"."id" = $9
---
  def update
    if @coupon.update(coupon_params)

SELECT  "coupons".* FROM "coupons" WHERE "coupons"."coupon_vendor_id" = $1 AND "coupons"."id" = $2 LIMIT 1  [["coupon_vendor_id", 2], ["id", 1]]
---
    def load_coupon
      @coupon = current_vendor.coupons.find(params[:id])